{
  "main": {
    "name":"John Zhang",
    "occupation":"Software Engineer",
    "description":"I find programing to be an adventure as well as constant puzzles waiting to be solved. The frustration of being stumped is off putting but the satisfaction of success is soooo addicting",
    "image":"profilepic.jpg",
    "bio":"I am a Software Engineer experienced in Ruby on Rails and JavaScript based programming with a background in Computer Support. I possess much experience in conveying technical terms to simpler interpretation. I am passionate about using my Software Engineering expertise to make complex technology, less so and for the usage of it's various tools to be an enjoyable experience. On the side I am a casual gamer, a platform that I would love to dive into and potentially show others a world I've only dreamt of.",
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "jnzhang622@gmail.com",
    "phone": "646-270-1672",
    "address":{
      "street":"32 Edward Ct",
      "city":"New York",
      "state":"New York",
      "zip": "10314"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload":"https://drive.google.com/file/d/1z9nheqlXmHGLkAkLS7QASd9GZPwnL30W/view?usp=sharing",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/johnzhang622/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"http://github.com/jnzhang622",
        "className":"fa fa-github"
      },
      {
        "name":"medium",
        "url":"https://www.medium.com/@jnzhang622",
        "className":"fa fa-book"
      }
    ]
  },
  "resume":{
    "skillmessage":"With a foundation in Ruby and Javascript, I am confident I can learn any framework. I love a challenge!",
    "education":[
      {
        "school":"Flatiron School",
        "degree":"Full-Stack Engineer",
        "graduated":"August 2020",
        "description":"Flatiron School is an intensive program where I was taught how to utilize Ruby/Rails and Javascript/React to create fully interactive websites. This rigorous program has a reputation of developing software engineers who utilize their education in the program to jump start a career in the fast-paced and high demand world of software engineering. "
      },
      {
        "school":"Devry College",
        "degree":"Network and System Administration",
        "graduated":"June 2016",
        "description":"I was taught how to utilize and manage network devices such as routers, switches and servers to build fully functioning computer networks."
      }
    ],
    "work":[
      {
        "company":"UnidataIT",
        "title":"Relocation Specialist",
        "years":"March 2010 - Present",
        "description":"Troubleshoot level 1 technical help desk problems as day 1 support to device relocations. (such as faulty mouse/keyboard/monitor, audio problems, monitor arm adjustments) Communicated in person professionally with a variety of users. Conduct logistical/technical surveys specifying quantities, placement, and location of end-user devices. Perform quality assurance testing to verify accurate drive mappings, IP addressing, host names, and functionality of applications by physical testing of equipment on site"
      }
    ],
    "skills":[
      {
        "name":"Git",
        "level":"40%"
      },
      {
        "name":"ReactJs",
        "level":"80%"
      },
      {
        "name":"CSS",
        "level":"60%"
      },
      {
        "name":"HTML5",
        "level":"70%"
      },
      {
        "name":"C++",
        "level":"30%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"uToobPlayer",
        "category":"Youtube has a habit of pausing my music if I've been idle, so I made my own custom player",
        "image":"utoobplayer.jpg",
        "url":"https://youtu.be/sSCJfxQ2ZFg"
      },
      {
        "title":"Coin Market Watch",
        "category":"An app to view information about bitcoins and keep an eye select ones",
        "image":"coinmarketwatch.jpg",
        "url":"https://youtu.be/U9av52Uhn_s"
      },
      {
        "title":"MultiStreamer",
        "category":"Website I built to watch multiple streams side by side (primarily Among Us)",
        "image":"multistreamer.jpg",
        "url":"https://youtu.be/8z8y1yk3Mbw"
      },
      {
        "title":"Pokemon Team Builder",
        "category":"A Ruby CLI app to keep track of Pokemon teams I make",
        "image":"pokemonteambuilder.jpg",
        "url":"https://youtu.be/3gAXutsQ59E"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"Testimonial of person 1",
        "user":"Some person 1"
      },
      {
        "text":"Testimonial of person 2",
        "user":"Some person 2"
      }
    ]
  }
}
